# 보안
[객체 지향 프로그래밍](#OOP(객체-지향-프로그래밍))<br />
<br />

## OOP(객체 지향 프로그래밍)
필요한 데이터를 추상화하여 속성(attributes)과 행위(methods)를 가진 객체를 만들고, 객체 간 유기적인 상호작용을 통해 로직을 구성하는 프로그래밍 패러다임

### 4가지 특징
- 추상화 : 공통의 속성이나 기능을 묶어 이름을 붙임. 클래스 정의 등
- 캡슐화 : 외부에 노출할 필요가 없는 정보를 private 은닉
- 상속 : 상위 클래스의 정의된 기능을, 하위 클래스가 재사용하거나 새로운 기능을 추가
- 다형성 : 객체가 상속으로 확장, 변경되어 여러 형태의 객체로 재구성(Overriding 재정의, Overloading 복수정의(인자 달라야함))

### 장단점
- 장점
   - 높은 코드 재사용성
   - 생산성 및 유지보수 우수
   - 자연적 모델링(일상언어와 유사)
- 단점
   - 개발속도 느림(모델링 과정 오래걸림)
   - 절차지향에 비해 실행속도가 느림(클래스 확인)
   - 객체가 많아짐에 따라 용량 커짐
<br />
